---
type: BeforeExecutedEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 1
tags: [revit-api, class]
---

# BeforeExecutedEventArgs

`Autodesk.Revit.UI.Events.BeforeExecutedEventArgs` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | UsingCommandData | 2017 | `public bool UsingCommandData { get ; set ; }` |